Revit 2027 API
Generic.GenericBumpMap Property
 The property labeled "Bump" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericBumpMap { get; }
Public Shared ReadOnly Property GenericBumpMap As String
	Get
public:
static property String^ GenericBumpMap {
	String^ get ();
}
static member GenericBumpMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace